postgresql/postgresql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-14 周三 20:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>postgresql入门</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">postgresql入门</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4ecf319">1. postgresql安装</a></li>
<li><a href="#orgf3d2908">2. 初始化设置</a></li>
<li><a href="#org6012f44">3. 开启数据库远程访问</a></li>
<li><a href="#orga021083">4. 常用数据库操作</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4ecf319" class="outline-2">
<h2 id="org4ecf319"><span class="section-number-2">1</span> postgresql安装</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>网络方式安装</li>
</ul>
<pre class="example">
&gt; sudo apt-get install postgresql
此过程，Linux系统中自动创建了一个postgres系统用户
postgresql数据库中自动创建了一个最高权限的postgres数据库用户
</pre>



<ul class="org-ul">
<li>修改数据库中的postgres用户密码</li>
</ul>
<pre class="example">
默认安装好的postgresql中，创建了一个数据库超级用户postgres，此用户为空密码，需修
改下密码
&gt; sudo -i 
&gt; su - postgres
&gt; psql
&gt; ALTER USER postgres with PASSWORD '123456';
&gt; \q                                                   //退出psql客户端
</pre>
</div>
</div>


<div id="outline-container-orgf3d2908" class="outline-2">
<h2 id="orgf3d2908"><span class="section-number-2">2</span> 初始化设置</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>创建数据库和数据库用户</li>
</ul>
<pre class="example">
&gt; su - postgres
&gt; psql
&gt; CREATE DATABASE iotadream;
&gt; CREATE USER hengjun WITH SUPERUSER PASSWORD '123456';//SUPERUSER：超级用户的意思，权限较高
&gt; \q                                                   //退出psql客户端
</pre>
</div>
</div>


<div id="outline-container-org6012f44" class="outline-2">
<h2 id="org6012f44"><span class="section-number-2">3</span> 开启数据库远程访问</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>编辑/etc/postgresql/9.5/main/postgresql.conf，允许任何主机来连接</li>
</ul>
<pre class="example">
vim /etc/postgresql/9.5/main/postgresql.conf
listen_addresses = '*'
</pre>


<ul class="org-ul">
<li>编辑/etc/postgresql/9.5/main/pg<sub>hba.conf为来连接的用户和数据库分配权限</sub></li>
</ul>
<pre class="example">
</pre>
</div>
</div>





<div id="outline-container-orga021083" class="outline-2">
<h2 id="orga021083"><span class="section-number-2">4</span> 常用数据库操作</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>查看数据库</li>
</ul>
<pre class="example">
\l
</pre>
<ul class="org-ul">
<li>查看数据库表</li>
</ul>
<pre class="example">
\dt
</pre>

<ul class="org-ul">
<li>退出</li>
</ul>
<pre class="example">
\q
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-12-14 周三 20:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
